import { sub } from "./index.js";

describe("sub", () => {
  it("基本的な計算：8-3=5の計算ができる", () => {
    expect(sub(8, 3)).toBe(5);
  });
  it("大きい数の計算：1000-5=995の計算ができる", () => {
    expect(sub(1000, 5)).toBe(995);
  });
  it("負の値を含む計算①：(-19)-3=-22の計算ができる", () => {
    expect(sub(-19, 3)).toBe(-22);
  });
  it("負の値を含む計算②：19-(-3)=22の計算ができる", () => {
    expect(sub(19, -3)).toBe(22);
  });
  it("0を含む計算①：0-4=-4の計算ができる", () => {
    expect(sub(0, 4)).toBe(-4);
  });
  it("0を含む計算②：19-0=19の計算ができる", () => {
    expect(sub(19, 0)).toBe(19);
  });
});
